const tournamentData = {
  "title": "جدول الدورة الرمضانية",
  "subtitle": "المسئول عن الموقع والتنظيم مهندس احمد مدحت علوش",
  "groupCount": 12,
  "matches": [
    {
      "date": "الجمعة 20/2",
      "time": "9:00",
      "group": 1,
      "team1": "نسور مصر",
      "team2": "بلال الصاوي"
    },
    {
      "date": "الجمعة 20/2",
      "time": "9:45",
      "group": 2,
      "team1": "عزبة يوسف",
      "team2": "الجزيرة"
    },
    {
      "date": "الجمعة 20/2",
      "time": "10:30",
      "group": 3,
      "team1": "أصدقاء محمد صبحي",
      "team2": "الدراويش"
    },
    {
      "date": "الجمعة 20/2",
      "time": "11:20",
      "group": 4,
      "team1": "زيزو",
      "team2": "نجوم كفر الدوار"
    },
    {
      "date": "السبت 21/2",
      "time": "9:00",
      "group": 3,
      "team1": "الحريفة",
      "team2": "محمود أشرف"
    },
    {
      "date": "السبت 21/2",
      "time": "9:45",
      "group": 9,
      "team1": "شباب أنطون يادس",
      "team2": "الاتحاد"
    },
    {
      "date": "السبت 21/2",
      "time": "10:30",
      "group": 1,
      "team1": "كابيتانو",
      "team2": "نسور دفشو"
    },
    {
      "date": "السبت 21/2",
      "time": "11:20",
      "group": 6,
      "team1": "ريال البيضا",
      "team2": "ميدو خليل"
    },
    {
      "date": "الأحد 22/2",
      "time": "9:00",
      "group": 4,
      "team1": "شباب الوراقية",
      "team2": "نمرة 2"
    },
    {
      "date": "الأحد 22/2",
      "time": "9:45",
      "group": 8,
      "team1": "مسعد أبورابح",
      "team2": "حسن الندي"
    },
    {
      "date": "الأحد 22/2",
      "time": "10:30",
      "group": 5,
      "team1": "شباب العدلي",
      "team2": "حريفة مساكن 1"
    },
    {
      "date": "الأحد 22/2",
      "time": "11:20",
      "group": 6,
      "team1": "نجوم أنطون يادس",
      "team2": "كوم أشو"
    },
    {
      "date": "الاثنين 23/2",
      "time": "9:00",
      "group": 7,
      "team1": "نجوم الورقية",
      "team2": "عتمان"
    },
    {
      "date": "الاثنين 23/2",
      "time": "9:45",
      "group": 11,
      "team1": "نجوم دفشو",
      "team2": "دبورة"
    },
    {
      "date": "الاثنين 23/2",
      "time": "10:30",
      "group": 7,
      "team1": "المداح",
      "team2": "اللؤلؤة"
    },
    {
      "date": "الاثنين 23/2",
      "time": "11:20",
      "group": 8,
      "team1": "مسعد أبورابح",
      "team2": "الجديدة"
    },
    {
      "date": "الثلاثاء 24/2",
      "time": "9:00",
      "group": 6,
      "team1": "ميدو خليل",
      "team2": "كوم أشو"
    },
    {
      "date": "الثلاثاء 24/2",
      "time": "9:45",
      "group": 9,
      "team1": "العمدوية",
      "team2": "عمر جمال"
    },
    {
      "date": "الثلاثاء 24/2",
      "time": "10:30",
      "group": 10,
      "team1": "نسور البيضا",
      "team2": "فخر الدين"
    },
    {
      "date": "الثلاثاء 24/2",
      "time": "11:20",
      "group": 11,
      "team1": "الديسياوي",
      "team2": "فوزي غانم منشأة بسيون"
    },
    {
      "date": "الأربعاء 25/2",
      "time": "9:00",
      "group": 2,
      "team1": "نجوم أبوشادي",
      "team2": "المغلاني"
    },
    {
      "date": "الأربعاء 25/2",
      "time": "9:45",
      "group": 10,
      "team1": "الرويني",
      "team2": "أباظة"
    },
    {
      "date": "الأربعاء 25/2",
      "time": "10:30",
      "group": 11,
      "team1": "فوزي غانم منشأة بسيون",
      "team2": "دبورة"
    },
    {
      "date": "الأربعاء 25/2",
      "time": "11:20",
      "group": 12,
      "team1": "حميصة",
      "team2": "النصر"
    },
    {
      "date": "الجمعة 27/2",
      "time": "9:00",
      "group": 3,
      "team1": "أصدقاء محمد صبحي",
      "team2": "الحريفة"
    },
    {
      "date": "الجمعة 27/2",
      "time": "9:45",
      "group": 11,
      "team1": "نجوم دفشو",
      "team2": "فوزي غانم منشأة بسيون"
    },
    {
      "date": "الجمعة 27/2",
      "time": "10:30",
      "group": 2,
      "team1": "الجزيرة",
      "team2": "المغلاني"
    },
    {
      "date": "الجمعة 27/2",
      "time": "11:20",
      "group": 2,
      "team1": "عزبة يوسف",
      "team2": "نجوم أبوشادي"
    },
    {
      "date": "السبت 28/2",
      "time": "9:00",
      "group": 5,
      "team1": "شباب دربالة",
      "team2": "حريفة مساكن 1"
    },
    {
      "date": "السبت 28/2",
      "time": "9:45",
      "group": 4,
      "team1": "زيزو",
      "team2": "شباب الوراقية"
    },
    {
      "date": "السبت 28/2",
      "time": "10:30",
      "group": 5,
      "team1": "الحاوي",
      "team2": "شباب العدلي"
    },
    {
      "date": "السبت 28/2",
      "time": "11:20",
      "group": 3,
      "team1": "الدراويش",
      "team2": "محمود أشرف"
    },
    {
      "date": "الأحد 1/3",
      "time": "9:00",
      "group": 6,
      "team1": "ريال البيضا",
      "team2": "نجوم أنطون يادس"
    },
    {
      "date": "الأحد 1/3",
      "time": "9:45",
      "group": 8,
      "team1": "الجديدة",
      "team2": "حسن الندي"
    },
    {
      "date": "الأحد 1/3",
      "time": "10:30",
      "group": 7,
      "team1": "نجوم الورقية",
      "team2": "المداح"
    },
    {
      "date": "الأحد 1/3",
      "time": "11:20",
      "group": 7,
      "team1": "عتمان",
      "team2": "اللؤلؤة"
    },
    {
      "date": "الاثنين 2/3",
      "time": "9:00",
      "group": 5,
      "team1": "الحاوي",
      "team2": "شباب دربالة"
    },
    {
      "date": "الاثنين 2/3",
      "time": "9:45",
      "group": 8,
      "team1": "الجديدة",
      "team2": "علي لمونه"
    },
    {
      "date": "الاثنين 2/3",
      "time": "10:30",
      "group": 9,
      "team1": "العمدوية",
      "team2": "شباب أنطون يادس"
    },
    {
      "date": "الاثنين 2/3",
      "time": "11:20",
      "group": 9,
      "team1": "عمر جمال",
      "team2": "الاتحاد"
    },
    {
      "date": "الثلاثاء 3/3",
      "time": "9:00",
      "group": 10,
      "team1": "فخر الدين",
      "team2": "الرويني"
    },
    {
      "date": "الثلاثاء 3/3",
      "time": "9:45",
      "group": 10,
      "team1": "نسور البيضا",
      "team2": "أباظة"
    },
    {
      "date": "الثلاثاء 3/3",
      "time": "10:30",
      "group": 12,
      "team1": "حميصة",
      "team2": "أنطونيادس"
    },
    {
      "date": "الثلاثاء 3/3",
      "time": "11:20",
      "group": 11,
      "team1": "نجوم دفشو",
      "team2": "الديسياوي"
    },
    {
      "date": "الأربعاء 4/3",
      "time": "9:00",
      "group": 12,
      "team1": "النصر",
      "team2": "PH"
    },
    {
      "date": "الأربعاء 4/3",
      "time": "9:45",
      "group": 1,
      "team1": "نسور مصر",
      "team2": "نسور دفشو"
    },
    {
      "date": "الأربعاء 4/3",
      "time": "10:30",
      "group": 1,
      "team1": "بلال الصاوي",
      "team2": "كابيتانو"
    },
    {
      "date": "الأربعاء 4/3",
      "time": "11:20",
      "group": 2,
      "team1": "عزبة يوسف",
      "team2": "المغلاني"
    },
    {
      "date": "الخميس 5/3",
      "time": "9:00",
      "group": 3,
      "team1": "الدراويش",
      "team2": "الحريفة"
    },
    {
      "date": "الخميس 5/3",
      "time": "9:45",
      "group": 3,
      "team1": "أصدقاء محمد صبحي",
      "team2": "محمود أشرف"
    },
    {
      "date": "الخميس 5/3",
      "time": "10:30",
      "group": 2,
      "team1": "الجزيرة",
      "team2": "نجوم أبوشادي"
    },
    {
      "date": "الخميس 5/3",
      "time": "11:20",
      "group": 4,
      "team1": "زيزو",
      "team2": "نمرة 2"
    },
    {
      "date": "الجمعة 6/3",
      "time": "9:00",
      "group": 5,
      "team1": "الحاوي",
      "team2": "حريفة مساكن 1"
    },
    {
      "date": "الجمعة 6/3",
      "time": "9:45",
      "group": 6,
      "team1": "ريال البيضا",
      "team2": "كوم أشو"
    },
    {
      "date": "الجمعة 6/3",
      "time": "10:30",
      "group": 5,
      "team1": "شباب دربالة",
      "team2": "شباب العدلي"
    },
    {
      "date": "الجمعة 6/3",
      "time": "11:20",
      "group": 4,
      "team1": "نجوم كفر الدوار",
      "team2": "شباب الوراقية"
    },
    {
      "date": "السبت 7/3",
      "time": "9:00",
      "group": 6,
      "team1": "ميدو خليل",
      "team2": "نجوم أنطون يادس"
    },
    {
      "date": "السبت 7/3",
      "time": "9:45",
      "group": 7,
      "team1": "نجوم الورقية",
      "team2": "اللؤلؤة"
    },
    {
      "date": "السبت 7/3",
      "time": "10:30",
      "group": 7,
      "team1": "عتمان",
      "team2": "المداح"
    },
    {
      "date": "السبت 7/3",
      "time": "11:20",
      "group": 8,
      "team1": "مسعد أبورابح",
      "team2": "علي لمونه"
    },
    {
      "date": "الأحد 8/3",
      "time": "9:00",
      "group": 9,
      "team1": "العمدوية",
      "team2": "الاتحاد"
    },
    {
      "date": "الأحد 8/3",
      "time": "9:45",
      "group": 8,
      "team1": "حسن الندي",
      "team2": "علي لمونه"
    },
    {
      "date": "الأحد 8/3",
      "time": "10:30",
      "group": 9,
      "team1": "عمر جمال",
      "team2": "شباب أنطون يادس"
    },
    {
      "date": "الأحد 8/3",
      "time": "11:20",
      "group": 10,
      "team1": "فخر الدين",
      "team2": "أباظة"
    },
    {
      "date": "الثلاثاء 10/3",
      "time": "9:00",
      "group": 10,
      "team1": "نسور البيضا",
      "team2": "الرويني"
    },
    {
      "date": "الاثنين 9/3",
      "time": "9:45",
      "group": 11,
      "team1": "دبورة",
      "team2": "الديسياوي"
    },
    {
      "date": "الاثنين 9/3",
      "time": "10:30",
      "group": 12,
      "team1": "PH",
      "team2": "حميصة"
    },
    {
      "date": "الاثنين 9/3",
      "time": "11:20",
      "group": 12,
      "team1": "النصر",
      "team2": "أنطونيادس"
    },
    {
      "date": "الثلاثاء 10/3",
      "time": "9:00",
      "group": 1,
      "team1": "نسور مصر",
      "team2": "كابيتانو"
    },
    {
      "date": "الثلاثاء 10/3",
      "time": "9:45",
      "group": 1,
      "team1": "بلال الصاوي",
      "team2": "نسور دفشو"
    },
    {
      "date": "الاثنين 9/3",
      "time": "9:00",
      "group": 4,
      "team1": "نجوم كفر الدوار",
      "team2": "نمرة 2"
    },
    {
      "date": "الثلاثاء 10/3",
      "time": "11:20",
      "group": 12,
      "team1": "PH",
      "team2": "أنطونيادس"
    }
  ],
  "groups": [
    {
      "id": 1,
      "name": "المجموعة 1",
      "teams": [
        {
          "name": "بلال الصاوي",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "نسور دفشو",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "نسور مصر",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "كابيتانو",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        }
      ]
    },
    {
      "id": 2,
      "name": "المجموعة 2",
      "teams": [
        {
          "name": "نجوم أبوشادي",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "المغلاني",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "عزبة يوسف",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "الجزيرة",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        }
      ]
    },
    {
      "id": 3,
      "name": "المجموعة 3",
      "teams": [
        {
          "name": "الحريفة",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "محمود أشرف",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "الدراويش",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "أصدقاء محمد صبحي",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        }
      ]
    },
    {
      "id": 4,
      "name": "المجموعة 4",
      "teams": [
        {
          "name": "زيزو",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "شباب الوراقية",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "نمرة 2",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "نجوم كفر الدوار",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        }
      ]
    },
    {
      "id": 5,
      "name": "المجموعة 5",
      "teams": [
        {
          "name": "شباب العدلي",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "حريفة مساكن 1",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "الحاوي",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "شباب دربالة",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        }
      ]
    },
    {
      "id": 6,
      "name": "المجموعة 6",
      "teams": [
        {
          "name": "ريال البيضا",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "نجوم أنطون يادس",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "ميدو خليل",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "كوم أشو",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        }
      ]
    },
    {
      "id": 7,
      "name": "المجموعة 7",
      "teams": [
        {
          "name": "المداح",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "اللؤلؤة",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "عتمان",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "نجوم الورقية",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        }
      ]
    },
    {
      "id": 8,
      "name": "المجموعة 8",
      "teams": [
        {
          "name": "الجديدة",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "مسعد أبورابح",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "علي لمونه",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "حسن الندي",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        }
      ]
    },
    {
      "id": 9,
      "name": "المجموعة 9",
      "teams": [
        {
          "name": "الاتحاد",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "شباب أنطون يادس",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "عمر جمال",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "العمدوية",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        }
      ]
    },
    {
      "id": 10,
      "name": "المجموعة 10",
      "teams": [
        {
          "name": "الرويني",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "أباظة",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "نسور البيضا",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "فخر الدين",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        }
      ]
    },
    {
      "id": 11,
      "name": "المجموعة 11",
      "teams": [
        {
          "name": "الديسياوي",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "دبورة",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "نجوم دفشو",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "فوزي غانم منشأة بسيون",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        }
      ]
    },
    {
      "id": 12,
      "name": "المجموعة 12",
      "teams": [
        {
          "name": "النصر",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "حميصة",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "PH",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        },
        {
          "name": "أنطونيادس",
          "played": 0,
          "won": 0,
          "lost": 0,
          "draw": 0,
          "gf": 0,
          "ga": 0,
          "gd": 0,
          "points": 0
        }
      ]
    }
  ]
};